


MIPSHOP Working Group                                         M. Liebsch
Internet-Draft                                                       NEC
Intended status: Experimental                                 A. Muhanna
Expires: August 15, 2009                                          Nortel
                                                                O. Blume
                                                Alcatel-Lucent Bell Labs
                                                       February 11, 2009


                Transient Binding for Proxy Mobile IPv6
             draft-ietf-mipshop-transient-bce-pmipv6-01.txt

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on August 15, 2009.

Copyright Notice

   Copyright (c) 2009 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.





Liebsch, et al.          Expires August 15, 2009                [Page 1]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


Abstract

   This document specifies a mechanism which enhances Proxy Mobile IPv6
   protocol signaling to support the creation of a transient binding
   cache entry which is used for inter-MAG handover optimization.  This
   mechanism is applicable to the mobile node's inter-MAG handover while
   using a single interface or different interfaces.  The handover
   problem space using the Proxy Mobile IPv6 base protocol is analyzed
   and the use of transient binding cache entries at the local mobility
   anchor is described.  The specified extension to the Proxy Mobile
   IPv6 protocol ensures optimized forwarding of downlink as well as
   uplink packets between mobile nodes and the network infrastructure
   and avoids superfluous packet forwarding delay or even packet loss.






































Liebsch, et al.          Expires August 15, 2009                [Page 2]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Conventions and Terminology  . . . . . . . . . . . . . . . . .  5
     2.1.  Conventions used in this document  . . . . . . . . . . . .  5
     2.2.  Terminology and Functional Components  . . . . . . . . . .  5
   3.  Analysis of the Problem Space  . . . . . . . . . . . . . . . .  6
     3.1.  Handover using a single interface  . . . . . . . . . . . .  6
     3.2.  Handover between interfaces  . . . . . . . . . . . . . . .  6
       3.2.1.  Issues with downlink traffic . . . . . . . . . . . . .  7
       3.2.2.  Issues with uplink traffic . . . . . . . . . . . . . .  9
     3.3.  Demand for a common solution . . . . . . . . . . . . . . . 10
   4.  Use of Transient Binding Cache Entries . . . . . . . . . . . . 11
     4.1.  General Approach . . . . . . . . . . . . . . . . . . . . . 11
     4.2.  Impact on Binding Management . . . . . . . . . . . . . . . 13
     4.3.  LMA Forwarding State Diagram . . . . . . . . . . . . . . . 13
     4.4.  MAG operation  . . . . . . . . . . . . . . . . . . . . . . 17
     4.5.  LMA operation  . . . . . . . . . . . . . . . . . . . . . . 18
       4.5.1.  Initiation of a transient BCE  . . . . . . . . . . . . 18
       4.5.2.  Activation of a transient BCE  . . . . . . . . . . . . 20
     4.6.  MN operation . . . . . . . . . . . . . . . . . . . . . . . 21
     4.7.  Status values  . . . . . . . . . . . . . . . . . . . . . . 21
     4.8.  Protocol Stability . . . . . . . . . . . . . . . . . . . . 21
   5.  Message Format . . . . . . . . . . . . . . . . . . . . . . . . 23
     5.1.  Transient Binding option . . . . . . . . . . . . . . . . . 23
   6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 25
   7.  Security Considerations  . . . . . . . . . . . . . . . . . . . 26
   8.  Protocol Configuration Variables . . . . . . . . . . . . . . . 27
   9.  Contributors . . . . . . . . . . . . . . . . . . . . . . . . . 28
   10. Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 29
   11. References . . . . . . . . . . . . . . . . . . . . . . . . . . 30
     11.1. Normative References . . . . . . . . . . . . . . . . . . . 30
     11.2. Informative References . . . . . . . . . . . . . . . . . . 30
   Appendix A.  Example Use Cases for Transient BCE . . . . . . . . . 31
     A.1.  Use case for Single Radio Handover . . . . . . . . . . . . 31
     A.2.  Use case for Dual Radio Handover . . . . . . . . . . . . . 33
   Appendix B.  Change Notes for version 1  . . . . . . . . . . . . . 36
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 37













Liebsch, et al.          Expires August 15, 2009                [Page 3]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


1.  Introduction

   The IETF specified Proxy Mobile IPv6 (PMIPv6) [RFC5213] as protocol
   for network-based localized mobility management, which takes basic
   operation for registration, tunnel management and deregistration into
   account.  In order to eliminate the risk of lost packets, this
   document specifies an extension to PMIPv6 that utilizes a new
   mobility option in the Proxy Binding Update (PBU) and the Proxy
   Binding Acknowledgement (PBA) between nMAG and LMA.

   According to the PMIPv6 base specification, an LMA updates a mobile
   node's Binding Cache Entry (BCE) and switches the forwarding tunnel
   after receiving a Proxy Binding Update (PBU) message from the mobile
   node's new MAG (nMAG).  At the same time the LMA disables the
   forwarding entry towards the mobile node's previous MAG (pMAG).  In
   case of an inter-technology handover, the mobile node's handover
   target interface must be configured according to the Router
   Advertisement being sent by the nMAG.  Address configuration as well
   as possible access technology specific radio bearer setup may delay
   the complete set up of the mobile node's new interface before it is
   ready to receive or send data packets.  In case the LMA prematurely
   forwards packets towards the mobile node's new interface, some
   packets may get lost or experience major packet delay.  The transient
   BCE extension, as specified in this document, avoids such loss for
   MNs, which have multiple network interfaces implemented while handing
   over from one interface to the other and for single radio MNs, which
   build on available radio layer forwarding mechanisms.

   Additionally, this document specifies an advanced binding cache
   management mechanism at the LMA according to well defined transient
   BCE states.  This mechanism ensures that forwarding states at LMAs
   are inline with the different handover scenarios.  During a transient
   state, a mobile node's BCE refers to two proxy-Care-of-Address (pCoA)
   entries, one from the mobile node's pMAG, an other from its nMAG.  A
   transient binding on the LMA can be controlled remotely, such as from
   a MAG, or by local information, such as events.  This document
   specifies advanced binding cache control by means of a Transient
   Binding option, which can be used with Proxy Mobile IPv6 (PMIPv6)
   signaling, to support transient BCEs.  Furthermore, this document
   specifies forwarding characteristics according to the current state
   of a binding to switch the forwarding tunnel at the LMA from the pMAG
   to the nMAG during inter-MAG handover according to the handover
   conditions.  As a result of transient binding support, handover
   performance can considerably be improved to smooth an MN's handover
   without introducing major complexity into the system.






Liebsch, et al.          Expires August 15, 2009                [Page 4]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


2.  Conventions and Terminology

2.1.  Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

2.2.  Terminology and Functional Components

   o  IF - Interface.  Any network interface, which offers a mobile node
      wireless or wired access to the network infrastructure.  In case a
      mobile node has multiple interfaces implemented, they are numbered
      (IF1, IF2, ...)

   o  Inter-RAT handover.  Handover between different radio access
      technologies.

   o  Transient Binding Cache Entry.  A temporary state of the mobile
      node Binding Cache Entry which defines the forwarding
      characteristics of the mobile node forwarding tunnels to the nMAG
      and pMAG.  This transient BCE state is created when the Transient
      Binding option is included in the PBU and PBA as specified in this
      document.  The LMA forwards the mobile node traffic according to
      current transient BCE characteristics as specified in this
      document.  The transient BCE state is transparent to the pMAG and
      the usage of the Transient Binding option is restricted to
      signaling between nMAG and LMA.

   o  Activation of a Transient Binding Cache Entry.  Initiates leaving
      the transient state of a Binding Cache Entry to become active.

   o  Active Binding Cache Entry.  A valid mobile node Binding Cache
      Entry according to [RFC5213], which is not in transient state.

















Liebsch, et al.          Expires August 15, 2009                [Page 5]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


3.  Analysis of the Problem Space

   This section summarizes the analysis of the handover problem space
   for inter-technology handover as well as intra-technology handover
   when using the PMIPv6 protocol as in [RFC5213].

3.1.  Handover using a single interface

   In some active handover scenarios, it is necessary to prepare the
   handover target MAG prior to the completion of the link layer
   handover procedures.  Packets sent by the LMA to the target MAG
   before the completion of the link layer handover procedure will be
   lost or need to be buffered.

   In some systems, the target MAG will be the recipient of uplink
   traffic prior to the completion of the procedure that would result in
   the PBU/PBA handshake.  These packets cannot be forwarded to the LMA.

   During an intra-technology handover, some of the MN's uplink traffic
   may still be in transit through the pMAG.  Currently and as per
   PMIPv6 base protocol [RFC5213], the LMA forwards the MN's uplink
   traffic received from a tunnel only as long as the source IP address
   of the MN's uplink traffic matches the IP address of the mobile
   node's registered Proxy-CoA in the associated BCE.  As a result,
   packets received at the LMA from the MN's pMAG after the LMA has
   already switched the tunnel to point to the nMAG will be dropped.

3.2.  Handover between interfaces

   In client based mobility protocols the handover sequence is fully
   controlled by the MN and the MN updates its binding and associated
   routing information at its mobility anchor after IP connectivity has
   been established on the new link.  On the contrary, PMIPv6 aims to
   relieve the MN from the IP mobility signaling, while the mobile node
   still controls link configuration during a handover.  This introduces
   a problem during an MN's handover between interfaces.  According to
   the PMIPv6 base protocol [RFC5213], the Access Authentication and the
   Proxy Binding Update (PBU) are triggered in the access network by the
   radio attach procedure, transparently for the MN.  In addition, a
   delay for the MN's new interface's address configuration is not
   considered in the handover procedure.  As a consequence, the
   immediate update of the MN's BCE after the PBU from the MN's nMAG has
   been received at the LMA has impact to the performance of the MN's
   downlink traffic as well as its uplink traffic.  Performance aspects
   of downlink as well as uplink traffic during a handover between
   interfaces are analyzed in the subsequent subsections.





Liebsch, et al.          Expires August 15, 2009                [Page 6]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


3.2.1.  Issues with downlink traffic

   Delay of availability of an MN's network interface can be caused by
   certain protocol operations that the MN needs to perform to configure
   its new interface and these operations can take time.  In order to
   complete the address auto-configuration on its new interface, the MN
   needs to send a router solicitation and awaits a router
   advertisement.  Upon receiving a router advertisement from the new
   MAG, the MN can complete its address configuration and perform
   Duplicate Address Detection (DAD) [RFC4862] on the new interface.
   Only then the MN's new interface is ready to receive packets.

   Address configuration can take more than a second to complete.  If
   the LMA has already switched the mobile node tunnel to point to the
   nMAG and started forwarding data packets for the MN to the nMAG
   during this time, these data packets may get delayed or lost because
   the MN's new interface is not yet ready to receive data.  However,
   delaying the PBU, which is sent from the new MAG to the LMA after the
   MN's new interface has attached to the network, is not possible, as
   the new MAG retrieves configuration data for the MN from the LMA in
   the PBA.  With host-based mobility protocols, such as Mobile IPv6
   [RFC3775], MNs can easily control when a binding is updated.  This is
   different for network-based mobility management, where hosts are not
   involved in IP mobility management [RFC4831]

   The aforementioned problem is exemplarily illustrated in Figure 1,
   which assumes that the HNP will be assigned under control of the LMA.
   Hence, the HNP option in the PBU, which is sent by the new MAG to the
   LMA, is set to ALL_ZERO.  An MN has attached to the network with
   interface (IF) IF1 and receives data on this interface.  When the
   MN's new interface IF2 comes up and is detected by the new MAG, the
   new MAG sends a PBU and receives a PBA from the LMA.  If the LMA
   decides to forward data packets for the MN via the new MAG, the new
   MAG has to buffer these packets until address configuration of the
   MN's new interface has completed and the MN's new interface is ready
   to receive packets.  While setting up IF2, the MN may not reply to
   address resolution signaling [RFC4861], as sent by the new MAG [A].
   If the MAG's buffer overflows or the MN cannot reply to address
   resolution signaling for too long, data packets for the MN are
   dropped and the MN can experience severe packet losses during an
   inter-technology handover [B] until IF2 is ready to receive and send
   data [C].









Liebsch, et al.          Expires August 15, 2009                [Page 7]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


       +------+                 +----+      +----+                 +---+
       |  MN  |                 |pMAG|      |nMAG|                 |LMA|
       +------+                 +----+      +----+                 +---+
       IF2 IF1                    |           |                      |
        |   |                     |           |                      |
        |   |- - - - - - - - - Attach         |                      |
        |   |                     |---------------PBU--------------->|
        |   |                     |<--------------PBA----------------|
        |   |--------RtSol------->|           |                      |
        |   |<-------RtAdv--------|           |                      |
        |  Addr.                  |           |                      |
        |  Conf.                  |           |                      |
        |   |<--------------------|==================data============|--
        |   |                     |           |                      |
        |- - - - - - - - - - - - - - - - - Attach                    |
        |   |                     |           |----------PBU-------->|
        |   |                     |           |<---------PBA---------|
        |   |                     |           |<-====data============|--
    [A]?|<-----------NSol---------------------|<-====data============|--
        |   |                     |      [B] ?|<-====data============|--
        |   |                     |          ?|<-====data============|--
        |-----------RtSol-------------------->|<-====data============|--
        |<----------RtAdv---------------------|            :         |
     Addr.  |                     |           |            :         |
     Conf.  |                     |           |            :         |
        |<-----------NSol---------------------|            :         |
        |------------NAdv------------------->[C]                     |
       !|<------------------------------------|======data============|--
        |   |                     |           |                      |
        |   |                     |           |                      |

                 Figure 1: Issue with inter-RAT mobility.

   Another risk for a delay in forwarding data packets from a new MAG to
   the MN's IF2 can be some latency in setting up a particular access
   technology's radio bearer or access specific security associations
   after the new MAG received the MN's HNP from the LMA via the PBA
   signaling message.

   In case an access technology needs the MN's IP address or HNP to set
   up a radio bearer between an MN's IF2 and the network infrastructure,
   the responsible network component might have to wait until the nMAG
   has received the associated information from the LMA in the Proxy
   Binding Acknowledgment.  Delay in forwarding packets from the nMAG to
   the MN's IF2 depends now on the latency in setting up the radio
   bearer.

   A similar problem can occur in case the set up of a required security



Liebsch, et al.          Expires August 15, 2009                [Page 8]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   association between the MN's IF2 and the network takes time and such
   set up can be performed only after the MN's IP address or HNP is
   available on the nMAG.

3.2.2.  Issues with uplink traffic

   In case of an inter-technology handover between two interfaces the MN
   may be able to maintain connectivity on IF1 while it is completing
   address configuration on IF2.  Such handover mechanism is called
   make-before-break and can avoid UL packet loss in client based Mobile
   IP.  However, in a PMIPv6 domain the attachment of the MN on IF2 will
   cause the nMAG to send a PBU to the LMA which will cause the LMA to
   update the BCE for this mobility session of the MN.  According to
   section 5.3.5 of the PMIPv6 base specification [RFC5213], the LMA
   will drop all subsequent packets being forwarded by the MN's pMAG due
   to the updated BCE, which refers now to the nMAG as Proxy-CoA.  Thus
   make-before-break handover is currently not supported by PMIPv6.

   A further issue for uplink packets arises from differences in the
   time of travel between nMAG and LMA in comparison with the time of
   travel between pMAG and LMA.  Even if the MN stops sending packets on
   IF1 before the PBU is sent (i.e. before it attaches IF2 to nMAG),
   uplink packets from pMAG may arrive at the LMA after the LMA has
   received the PBU from nMAG.  Such situation can in particular occur
   when the MN's previous link has a high delay (e.g. a GSM link) and is
   slow compared to the handover target link.  This characteristic is
   exemplarily illustrated in Figure 2.
























Liebsch, et al.          Expires August 15, 2009                [Page 9]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


      +------+              +----+                   +---+
      |  MN  |              |nMAG|                   |LMA|
      +------+              +----+                   +---+
      IF2 IF1                 |                        |
       |   |\                 |                        |BCE exists
       |   |    \             |                        | for pMAG
       |- -|- - - - \- - - - Attach                    |
       |   |           s\     |---------PBU----------->|BCE update
       |   |               l\ |<--------PBA------------| for nMAG
       |   |                   o\                      |
       |   |                  |    w\                  |
       |   |                  |        l\              |
       |   |                  |            i\          |
       |   |                  |               n \      |packet dropped
       |   |                  |                  k --->| as BCE has only
       |   |                  |                        | entry for nMAG
       |   |                  |                        |
       |   |                  |                        |

              Figure 2: Uplink traffic issue with slow links.

3.3.  Demand for a common solution

   To reduce the risk of packet loss, some settings on an MN could be
   chosen appropriately to speed up the process of network interface
   configuration.  Also tuning some network parameters, such as
   increasing the buffer capacity on MAG components, could improve the
   handover performance.  However, some network characteristics, such as
   access link delay or bearer setup latency, cannot be easily fine
   tuned to suit a particular handover scenario.  Thus, a common
   solution which dynamically controls and enhances this handover
   complexity using a simple extension to the PMIPv6 base protocol is
   extremely preferred.

   This document specifies transient BCEs as an extension to the PMIPv6
   protocol.  Set up and configuration of a transient BCE can be
   performed by means of standard PMIPv6 signaling messages between the
   MAG and the LMA component using a new Transient Binding mobility
   option.  The transient BCE mechanism supports three clearly
   distinguished sequences of transient states to suit various handover
   scenarios and to improve handover performance for both, inter- and
   intra-technology handover.  As a result of using transient BCEs,
   excessive packet buffering at the target MAG during the MN's handover
   process is not necessary and packet losses and major jitter can be
   avoided.






Liebsch, et al.          Expires August 15, 2009               [Page 10]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


4.  Use of Transient Binding Cache Entries

4.1.  General Approach

   The use of transient BCE during an MN's handover (HO) enables greater
   control on the forwarding of uplink (Ul) and downlink (Dl) traffic to
   harmonize handover performance characteristics with the capabilities
   of the handover source and target access networks.  Updating of an
   MN's BCE at an LMA is split into different phases before and after
   the radio setup and IP configuration being associated with the MN's
   handover from a pMAG to a nMAG.

   The use of a transient BCE during an MN's handover splits into an
   initiation phase and an activation phase.  Figure 3 illustrates the
   procedure to enter and activate a transient BCE during an MN's
   handover.  As a result of the MN's attachment at the nMAG, the first
   PBU from the MN's nMAG performs configuration of a transient BCE at
   the LMA and the nMAG by including a Transient Binding option.  The
   LMA enters the nMAG as a further forwarding entry to the MN's BCE
   without deleting the existing forwarding entry and marks the BCE
   state as 'transient'.  After receiving the PBA, the nMAG enters the
   MN's data, such as the assigned HNP, into its BUL and marks the MN's
   binding with the LMA as 'transient', which serves as an indication to
   the nMAG that the transient BCE needs activation.  During the
   transient state, the LMA accepts uplink packets from both MAGs, the
   pMAG and the nMAG, for forwarding.  To benefit from the still
   available downlink path from pMAG to MN, the LMA forwards downlink
   packets towards the pMAG until the transient BCE gets activated.
   Such downlink forwarding characteristic is denoted as 'Late path
   switch' (L).

   Decision about the classification of an MN's BCE as transient can be
   done either by the nMAG or the LMA.  Detailed mechanisms how a nMAG
   or an LMA finds out to use a transient BCE procedure are out of scope
   of this document.

   A transient BCE can be activated by different means, such as a
   timeout at the LMA, a PBU from the nMAG, which has no Transient
   Binding option included or a deregistration PBU from the pMAG.  As
   soon as the MN's BCE gets activated, the LMA switches the forwarding
   path for downlink packets from the pMAG to the nMAG.

   This specification considers an optional state during the activation
   (A) of a transient BCE with a late path switch, which keeps the pMAG
   for some more time as forwarding entry in the transient BCE, solely
   to ensure forwarding of delayed uplink packets from the pMAG.  This
   optional activation state has a lifetime associated and termination
   does not need any signaling.  Whether or not to enter this optional



Liebsch, et al.          Expires August 15, 2009               [Page 11]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   activation state when a transient BCE is activated is signaled by
   means of flags in the Transient Binding option.


    +-----+            +----+    +----+                +-----+
    | MN  |            |pMAG|    |nMAG|                | LMA |
    +-----+            +----+    +----+                +-----+
       |                  |         |                     |
       |                  |         |                     |[pMAG serves
       |                  |         |                     | MN as pCoA]
       |                  |         |                     |
       |<-----------------|===============data tunnel=====|--->data
       |                  |         |                     |
   [Handoff               |         |                     |
     Start]               |         |                     |
       |                  |         |                     |
      e|-----------------------[MN Attach]                |
      x|                  |         |                     |
      e|                  |         |---PBU(transient)--->|[Add nMAG to
      c|                  |         |                     | MN's BCE,
      u|                  |         |<--PBA(transient)----| enter trans-
      t|                  |         |                     | ient state]
      i|                  |         |                     |
      o|<-----Dl+Ul-------|===============data tunnel=====|--->data
      n|--------Ul------------------|=====data tunnel=====|--->data
       |                  |         |                     |
    [Handoff/             |         |                     |
   Configuration          |         |                     |
    Completed]            |   [HO Complete]               |
       |                  |         |--------PBU--------->|[Activate
       |                  |         |                     | MN's BCE,
       |                  |         |<-------PBA ---------| update for-
       |                  |         |                     | warding path
       |                  |         |                     | to nMAG]
       |                  |         |                     |
       |<---------------------------|=====data tunnel=====|--->data
       |                  |         |                     |


     Figure 3: General mechanism and forwarding characteristics during
                       handover with transient BCE.

   The flags in the Transient Binding option allow configuration of
   using one out of three sequences through the transient BCE states,
   which are illustrated and described in Section 4.3.  Details about
   the Transient Binding option and its use are described in Section 4.4
   and Section 4.5.  Section 4.2 describes the required extension to an
   LMA's binding cache to support transient BCE operation.



Liebsch, et al.          Expires August 15, 2009               [Page 12]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


4.2.  Impact on Binding Management

   The use of a transient BCE requires temporary maintenance of two
   forwarding entries in the MN's BCE at the LMA, one referring to the
   MN's pMAG, the other referring to its nMAG.  Forwarding entries are
   represented according to [RFC5213] and comprise the interface
   identifier of the associated tunnel interface towards each MAG, as
   well as the associated access technology information.  Each
   forwarding entry is assigned a forwarding rule to admit and control
   forwarding of uplink and downlink traffic to and from the associated
   MAG.  Hence, according to this specification, a forwarding entry can
   have either a rule that allows only forwarding of uplink traffic from
   the associated MAG, or a rule that allows bidirectional forwarding
   from and to the associated MAG.  At any time, only one of the two
   forwarding entries can have a bi-directional forwarding rule.  The
   interface identifier and access technology type info can be taken
   from the PBU received at the LMA and linked to each forwarding entry
   accordingly.

   MAGs should maintain the status of an MN's binding and the lifetime
   associated with a transient BCE at the LMA in their binding update
   list.  This is in particular important in case a new MAG needs to
   explicitly activate a binding after the associated MN's new interface
   has proven to be ready to handle IP traffic.

4.3.  LMA Forwarding State Diagram

   The current specification of transient BCEs covers three clearly
   defined transient BCE states at an LMA during an MN's handover.  Each
   state implies a dedicated characteristic regarding forwarding
   entries, in which forwarding rules for uplink traffic are maintained
   separately from downlink traffic.  This section explains how the
   forwarding state sequentially changes during the optimized handoff.
   To suit different handover scenarios, three different sequences
   through the forwarding states can be entered and signaled by means of
   flags in the Transient Binding option.  Figure 4 depicts the possible
   cases, their sequence of forwarding states and the triggers for the
   transitions.  Two example use cases are described in detail in
   Appendix A to illustrate which sequence through the forwarding states
   suits a particular handover.

   According to this specification, each BCE has a state associated,
   which can be either 'Active' or any of the specified transient states
   'Transient-L', 'Transient-LA' or 'Transient-A'.  In case a BCE is in
   state 'Active', the information in a BCE and associated forwarding
   conforms to [RFC5213].  Which sequence through the transient states
   should be entered will be signaled in the Transient Binding option by
   means of two flags (L- and A-Flag, see Section 5 for details).



Liebsch, et al.          Expires August 15, 2009               [Page 13]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   Any of the transient states implies that the transient BCE has two
   forwarding entries, which are denoted as pMAG and nMAG in the
   forwarding state diagram.  The diagram includes information about the
   forwarding rule along with each forwarding entry.  This rule
   indicates whether a forwarding entry is meant to perform forwarding
   only for Uplink (Ul) traffic or to perform bi-directional forwarding
   for Uplink (Ul) and Downlink (Dl) traffic.

   State transitions can be triggered as a result of processing a
   received PBU or by a local timeout event on the LMA.  Presence of a
   Transient Binding option in a PBU is indicated by 'Topt' as argument
   to a PBU or PBA respectively.  As a further argument to a PBU
   message, the source of the message is indicated, which can be either
   the MN's nMAG or its pMAG.  The values of the Transient Binding
   option flags 'L' and 'A' are indicated in brackets as argument to the
   Topt.

   Figure 4 illustrates the three possible transitions between an active
   BCE and a transient BCE based on the assumption that the nMAG
   controls the use of a transient BCE during an MN's handover by means
   of including a Transient Binding option in the PBU message.

   The same diagram applies for the case that the LMA takes the decision
   to use any of the specified transient BCE handover sequences.  The
   LMA indicates the use of a transient BCE by means of including the
   Transient Binding option in the PBA it sends back to the MN's nMAG.
   As the forwarding characteristics according to the transient BCE
   states are independent of whether a MAG or an LMA takes the decision
   to use a transient BCE during a handover, LMA-initiated use and
   indication of a transient BCE is not explicitly covered in the
   diagram.

   The diagram refers to two timeout events.  TIMEOUT_1 is set according
   to the Lifetime value in a Transient Binding option (see Section 5
   for the format of the Transient Binding option), whereas TIMEOUT_2 is
   set to ACTIVATIONDELAY (see Section 8 for the default value).

   The three possible sequences of a transient BCE handover are
   reflected in the diagram below.  The first of these is going through
   state Transient-L to support a late path switch.  The use of entering
   this sequence is signaled by having the L-Flag of the Transient
   Binding option set to 1 and the A-Flag set to 0.  In this state, the
   LMA continues forwarding downlink packets to the pMAG, whereas uplink
   packets are accepted and forwarded from both, the pMAG and the nMAG.
   After the Transient-L state has been left either due to the reception
   of a PBU without Transient Binding option included from the nMAG, a
   TIMEOUT_1 event or the reception of a deregistration PBU from the
   pMAG, the BCE state changes to active.



Liebsch, et al.          Expires August 15, 2009               [Page 14]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   The second sequence implies entering the state Transient-LA when the
   LMA receives a PBU with a Transient Binding option having the L-Flag
   and the A-Flag set to 1.  Forwarding characteristics in this state
   are the same as for the Transient-L state.  After the Transient-LA
   state has been left due to the reception of a PBU without Transient
   Binding option included from the nMAG or a TIMEOUT_1 event, the BCE
   state changes to an activating state Transient-A.  In the Transient-A
   state, the LMA performs a downlink forwarding path switch from the
   pMAG to the nMAG, whereas uplink packets are still accepted and
   forwarded from both, the pMAG and the nMAG.  The Transient-A state is
   terminated by a TIMEOUT_2 event and results in turning the BCE state
   to active.  In case the LMA receives a deregistration PBU from the
   pMAG while the associated MN's BCE is in state Transient-LA, the BCE
   is turned to active immediately without entering state Transient-A
   before.

   The third sequence does not imply a late path switch, but ensures
   acceptance and forwarding of uplink packets from both MAGs, the pMAG
   and the nMAG, during the transient binding phase.  In case the LMA
   receives a PBU with a Transient Binding option having the L-Flag set
   to 0 and the A-Flag set to 1 for an active BCE, the LMA turns the BCE
   state to Transient-A.  The BCE is turned to active when a TIMEOUT_2
   event occurs or a deregistration PBU from the pMAG has been received
   before.



























Liebsch, et al.          Expires August 15, 2009               [Page 15]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


                                           +----------+
                                           | No Entry |
                                           +----------+
                                                |
                                                | PBU(pMAG)
                                                V
                                         +----------------+
                PBU(nMAG)                |    Active      |
    +------------------------------------|                |
    |                                    |  pMAG [Dl,Ul]  |
    |                                    +----------------+
    |           PBU(nMAG, Topt[L=1,A=0])   |    |       |
    |           +--------------------------+    |       |
    |           |                               |       |PBU(nMAG,
    |           |       PBU(nMAG, Topt[L=1,A=1])|       |Topt[L=0,A=1])
    |           V                               V       |
    |    +--------------+          +--------------+     |
    |    | Transient-L  |          | Transient-LA |     |
    |    |              |          |              |     |
    |    | pMAG [Dl,Ul] |      +---| pMAG [Dl,Ul] |     |
    |    | nMAG [Ul]    |      |   | nMAG [Ul]    |     |
    |    +--------------+      |   +--------------+     |
    |           |              |           |            |
    |           |   PBU(pMAG,  |           |            |
    |           |   lifetime=0)|  PBU(nMAG)|TIMEOUT_1   |
    |           |              |           |            |
    |           |              |           V            V
    |           |              |          +--------------+
    |           |              |          | Transient-A  |
    |  PBU(nMAG)|TIMEOUT_1     |          |              |
    |           |              |          | nMAG [Dl,Ul] |
    |           |PBU(pMAG,     |          | pMAG [Ul]    |
    |           | lifetime=0)  |          +--------------+
    |           |              |                 |
    |           |              |    PBU(pMAG,    |
    |           |              |     lifetime=0) | TIMEOUT_2
    |           |              |                 V
    |           |              |          +--------------+
    |           |              +--------->|    Active    |
    |           +------------------------>|              |
    +------------------------------------>| nMAG [Dl,Ul] |
                                          +--------------+


     Figure 4: Possible transient forwarding states during a handover.






Liebsch, et al.          Expires August 15, 2009               [Page 16]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


4.4.  MAG operation

   In case of a handover, the MN's nMAG may decide to control the MN's
   handover at the LMA according to any of the three possible sequences
   through the transient BCE forwarding states as described in this
   specification.  In such case, the nMAG includes the Transient Binding
   option in the PBU message it sends to the MN's LMA.  If the nMAG
   wants the LMA to perform a late path switch, it sets the L-flag of
   the Transient Binding option to 1.  If the nMAG wants the LMA to
   enter a temporary activation state after the activation of a
   transient BCE has been initiated, the nMAG sets the A-flag along with
   the L-flag in the Transient Binding option to 1.  Otherwise, the nMAG
   may set the L-flag to 1 and the A-flag to 0 to perform a handover
   without entering the activation state Transient-A.

   In case the nMAG does not control the LMA to perform a late path
   switch, but wants to ensure temporary forwarding of uplink traffic at
   the LMA from the pMAG and from the nMAG, it may set the L-flag to 0
   and the A-flag to 1.  The nMAG SHOULD NOT use the Transient Binding
   option with both flags set to 0.  In any case where the nMAG includes
   the Transient Binding option in the PBU with the L-Flag set to 1, it
   MUST set the Lifetime field of the Transient Binding option to a
   value larger than 0 to propose a maximum lifetime of the transient
   BCE.  The chosen lifetime value for the Transient Binding option
   SHOULD be smaller than the chosen lifetime value for the PBU
   registration.  If the L-Flag of the Transient Binding option is set
   to 0, the timer SHALL be set to 0.  Other fields and options of the
   PBU are used according to [RFC5213]

   In case the nMAG does not include a Transient Binding option but the
   LMA decides to perform a handover according to the transient BCE
   procedure, the nMAG may receive a Transient Binding option along with
   the PBA from the LMA as a result of the PBU it sent to the LMA.

   In case the nMAG receives a PBA with a Transient Binding option, it
   SHOULD link the information about the transient BCE sequence and the
   associated transient BCE lifetime with the MN's entry in the BUL.
   Only in case the L-flag of the Transient Binding option is set to 1,
   the nMAG MAY activate the MNs transient BCE before expiration of the
   transient BCE lifetime by means of sending an updating PBU to the LMA
   without including a Transient Binding option.  All fields of the PBU
   MAY be set according to the procedure for binding lifetime extension
   described in section 5.3.3 of [RFC5213].  In case the lifetime of a
   transient BCE expires or the LMA approves the activation of a
   transient BCE as a result of a PBU sent by the nMAG, the nMAG MUST
   delete all information associated with a transient BCE from the MN's
   BUL entry.




Liebsch, et al.          Expires August 15, 2009               [Page 17]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   In case where the nMAG decides to include a Transient Binding option
   into the PBU, only one instance of the Transient Binding option per
   PBU is allowed.

   A MAG, which serves the MN current pCoA while the LMA already has an
   active binding for the MN pointing to this MAG, SHALL NOT include a
   Transient Binding option in any subsequent PBU being associated with
   the MN's registration.

4.5.  LMA operation

4.5.1.  Initiation of a transient BCE

   In case the LMA receives a handover PBU from a MN's nMAG which does
   not include a Transient Binding option and the associated MN's BCE is
   active and not in transient state, the LMA MAY take the decision to
   use a transient BCE and inform the nMAG about the transient BCE
   characteristics by including a Transient Binding option in the PBA.
   In such case, the LMA should know about the nMAG's capability to
   support the Transient Binding option and the associated procedure.
   The configuration of the MN's transient BCE is done according to the
   description in this section and the selected transient state.
   Otherwise, the LMA processes the PBU according to the PMIPv6 protocol
   [RFC5213] and performs normal update of the MN's BCE.

   In case the PBU from the nMAG has a Transient Binding option
   included, the LMA must identify the sequence of transient BCE states
   according to the L-flag and the A-flag settings received in the
   Transient Binding option.  In case the LMA finds the L-flag set to 1,
   but the A-flag set to 0, the LMA configures the MN's transient BCE
   and the forwarding rules according to state Transient-L.  As a
   result, the LMA performs a late path switch and forwards downlink
   packets for the MN towards the MN's pMAG, whereas uplink packets
   being forwarded from both Proxy-CoAs, the MN's pMAG as well as from
   its nMAG, will be routed by the LMA.  The LMA sets the lifetime of
   the transient BCE according to the lifetime indicated by the nMAG in
   the Transient Binding option's lifetime field or may decide to reduce
   the lifetime according to its policy.  If the lifetime value in the
   Transient Binding option exceeds the lifetime value associated with
   the PBU message, the LMA MUST reduce the lifetime of the transient
   BCE to a value smaller than the registration lifetime value in the
   PBU message.  In case of a successful transient BCE registration, the
   LMA sends a PBA with a Transient Binding option back to the nMAG.
   The L-flag and the A-flag of the Transient Binding option included in
   the PBA are set according to the values received in the PBU, whereas
   the lifetime field is set to the value finally chosen by the LMA.

   In case the LMA finds the L-flag and the A-flag set to 1, the LMA



Liebsch, et al.          Expires August 15, 2009               [Page 18]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   configures the MN's transient BCE and the forwarding rules according
   to state Transient-LA.  As a result, the LMA performs a late path
   switch and forwards downlink packets for the MN towards the MN's
   pMAG, whereas uplink packets being forwarded from both Proxy-CoAs,
   the MN's pMAG as well as from its nMAG, will be routed by the LMA.
   In addition, the LMA marks the transient BCE to enter a temporary
   activation phase in state Transient-A after the LMA received an
   indication to activate a transient BCE.  The LMA sets the lifetime of
   the transient BCE according to the lifetime indicated by the nMAG in
   the Transient Binding option's lifetime field or may decide to reduce
   the lifetime.  If the lifetime value in the Transient Binding option
   exceeds the lifetime value associated with the PBU message, the LMA
   MUST reduce the lifetime of the transient BCE to a value smaller than
   the registration lifetime value in the PBU message.  In case of a
   successful transient BCE registration, the LMA sends a PBA with a
   Transient Binding option back to the nMAG.  The L-flag and the A-flag
   of the Transient Binding option included in the PBA are set according
   to the values received in the PBU, whereas the lifetime field is set
   to the value finally chosen by the LMA.

   In case the LMA finds the L-flag of the received Transient Binding
   option set to 0 but the A-flag set to 1, the LMA configures the MN's
   transient BCE and the forwarding rules according to state Transient-A
   to support early path switching and enters state Transient-A.  As a
   result, the LMA forwards downlink packets for the MN towards the MN's
   nMAG, whereas uplink packets being forwarded from both Proxy-CoAs,
   the MN's pMAG as well as from its nMAG, will be routed by the LMA.
   The LMA sends a PBA with a Transient Binding option included back to
   the nMAG.  The L-flag and the A-flag of the Transient Binding option
   included in the PBA are set according to the values received in the
   PBU, whereas the lifetime field is set to 0 by the LMA.

   In any case where the LMA finds the L-flag of the received Transient
   Binding option set to 1, but the lifetime field of the Transient
   Binding option is set to 0, the LMA MUST ignore the Transient Binding
   option and process the PBU according to [RFC5213].  After the PBU has
   been processed successfully, the LMA sends back a PBA with the status
   field set to PBU_ACCEPTED_TB_IGNORED.

   In case the LMA finds the L-flag as well as the A-flag of the
   received Transient Binding option set to 0, the LMA MUST ignore the
   Transient Binding option and process the PBU according to the PMIPv6
   base protocol [RFC5213].  After the PBU has been processed
   successfully, the LMA sends back a PBA with the status field set to
   PBU_ACCEPTED_TB_IGNORED.

   In case the LMA receives a PBU with a Transient Binding option
   included from a MAG which serves already as pCoA to the associated



Liebsch, et al.          Expires August 15, 2009               [Page 19]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   MN, the LMA MUST ignore the Transient Binding option and process the
   PBU according to [RFC5213].  After the PBU has been processed
   successfully, the LMA sends back a PBA with the status field set to
   PBU_ACCEPTED_TB_IGNORED.

4.5.2.  Activation of a transient BCE

   When the LMA receives a PBU from an MN's nMAG which has no Transient
   Binding option included, the LMA should check whether the MN's BCE is
   in any of the specified transient states.  If the MN's BCE is not
   transient, the LMA processes the PBU and updates the MN's BCE
   according to the PMIPv6 protocol [RFC5213].  When the LMA receives a
   PBU from the MN's pMAG and the MN's BCE is not transient, the LMA
   performs protocol operation and an update of the MN's BCE according
   to the PMIPv6 base protocol [RFC5213].

   When the LMA receives a PBU from the MN's nMAG which has no Transient
   Binding option included but the MN's BCE is in a transient state or
   the LMA receives a local event trigger due to expiration of MN's
   transient BCE, the LMA should check whether the forwarding rules for
   the associated MN are set to route the MN's downlink traffic to the
   MN's pMAG.  If the forwarding entry for downlink packets refers to
   the MN's pMAG, the LMA must update the forwarding information to
   forward downlink packets towards the MN's nMAG.  After the forwarding
   path has been switched, the LMA must update the MN's BCE accordingly.

   If the transient BCE indicates that the LMA must consider an
   activation phase after leaving a transient BCE has been initiated,
   the LMA must keep both forwarding entries for the pMAG and the nMAG
   for uplink packets and perform forwarding of packets it receives from
   both Proxy-CoAs.  If the activation phase can be omitted, the LMA
   sets the state of the MN's BCE to active and deletes any forwarding
   entry referring to the MN's pMAG.  The LMA must delete any scheduled
   timeout event for the MN which are associated with a transient BCE.

   When the LMA receives a deregistration PBU from the MN's pMAG, which
   has the registration lifetime set to 0 and the MN's BCE is in
   transient state, the LMA must update the forwarding rules for the MN
   and switch the downlink traffic path from the pMAG to the nMAG.
   Furthermore, the LMA sets the state of the MN's BCE to active and
   removes any forwarding entry towards the pMAG from the MN's BCE,
   irrespective whether or not the transient BCE was configured to enter
   a temporary activation state.

   When the LMA receives a local event trigger due to expiration of a
   timer which has been set to ACTIVATIONDELAY and scheduled to
   terminate the activation state of an MN's transient BCE, the LMA sets
   the state of the MN's BCE to active and removes any forwarding entry



Liebsch, et al.          Expires August 15, 2009               [Page 20]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   towards the pMAG from the MN's BCE.

4.6.  MN operation

   Operation of MN to support handover and choosing appropriate settings
   for a transient BCE is out of scope of this specification.  The same
   applies to mechanisms for the nMAG to detect the possibility to use
   transient BCEs, e.g. the simultaneous use of two interfaces during
   the handover.  One solution is that the MN signals its intent for
   transient bindings to the MAG, either using radio layer protocols
   between MN and MAG or with dedicated IP-based signaling.

   This document focuses on extensions required in the MAG and in the
   LMA.  Other documents address issues of the MN operation with PMIPv6,
   such as [I-D.premec-netlmm-intertech-handover] and
   [I-D.sarikaya-netlmm-itho].

   It is further out of the scope of this document how the MN can
   perform address configuration of the same IP address for two
   simultaneously attached interfaces.

4.7.  Status values

   This section specifies the following PBA status value for transient
   binding cache entry support.  This status value must be smaller than
   128 and adds to the set of status values specified in [RFC5213].

   o  PBU_ACCEPTED_TB_IGNORED: [IANA] The LMA has processed and accepted
      the PBU, but the attached Transient Binding option has been
      ignored.

4.8.  Protocol Stability

   The specification and use of transient BCEs ensures that correct
   PMIPv6 operation according to [RFC5213] will not be broken in any
   case.  Such cases include loss of signaling information and
   incompatibility between a nMAG and an LMA in case one or the other
   side does not support the transient BCE option.  The following list
   summarizes such cases and describes how the PMIPv6 protocol operation
   resolves from incompatibility or loss of a signaling message.

   o  LMA does not support transient BCEs: In case the nMAG sends a PBU
      with a Transient Binding option included to an LMA but the LMA
      does not support transient BCEs, the LMA ignores the unknown
      option [RFC3775] and processes the PBU according to [RFC5213].

   o  nMAG does not support transient BCEs: In case the LMA takes the
      decision to perform a handover according to any of the specified



Liebsch, et al.          Expires August 15, 2009               [Page 21]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


      transient BCE sequences and includes a Transient Binding option in
      the PBA, the receiving nMAG ignores the unknown option [RFC3775]
      and processes the PBA according to [RFC5213].  As the LMA does not
      get any further indication or feedback about the incompatibility
      at the nMAG, the LMA enters the selected transient state, which
      will be terminated at the latest after (TIMEOUT_1 +
      ACTIVATIONDELAY) seconds.  During this period, the nMAG performs
      according to the PMIPv6 specification [RFC5213], whereas the LMA
      will accept all uplink packets for the MN from the pMAG as well as
      from the nMAG according to the transient BCE specification.  It is
      transparent to the nMAG if the LMA forwards downlink packets to
      the pMAG during the transient BCE phase, thus no protocol conflict
      occurs due to the different states on the nMAG and the LMA.

   o  Loss of Transient Binding option: As the Transient Binding option
      is included in the PBU and PBA, recovery from signaling packet
      loss is according to the PMIPv6 protocol operation and associated
      re-transmission mechanisms [RFC5213].

   o  Missing PBU to activate a transient BCE: According to this
      specification, a lifetime for TIMEOUT_1 is signaled in the
      Transient Binding option and the activation of a transient state
      is initiated at the latest after the timer TIMEOUT_1 has elapsed.
      Thus it is not possible that due to the loss of signaling or due
      to a failure of the nMAG to activate a transient BCE the transient
      state may not get terminated, i.e. stable operation of the PMIPv6
      protocol [RFC5213] has reliably recovered.
























Liebsch, et al.          Expires August 15, 2009               [Page 22]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


5.  Message Format

5.1.  Transient Binding option

   This section describes the format of the Transient Binding option,
   which can be present in a Proxy Binding Update message and a Proxy
   Binding Acknowledge message.  The use of this Mobility Header option
   is optional.

   The Transient Binding option can be included in a PBU message which
   is sent by a MN's nMAG as a result of a handover.  In such case, the
   nMAG controls the transient BCE on the LMA by means of setting the
   L-flag and the A-flag accordingly.  Alternatively, the LMA may attach
   the Transient Binding option in a PBA for two reasons.  Either it
   replies to a received PBU with an attached Transient Binding option
   to approve or correct the transient BCE lifetime, or it notifies the
   nMAG about its decision to enter a transient BCE without having
   received a Transient Binding option from the nMAG in the associated
   PBU beforehand.

   The format of the Transient Binding option is as follows.




       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |    Type       |     Length    | Reserved  |A|L|   Lifetime    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                 Figure 5

   Type: Identifies the Transient Binding option.  To be assigned by
   IANA.

   Length: 8-bit unsigned integer indicating the length of the option in
   octets, excluding the Type and the Length fields.  This field MUST be
   set to 2.

   L-Flag: Indicates that the LMA applies late path switch according to
   the transient BCE state.  If the L-flag is set to 1, the LMA
   continues to forward downlink packets towards the pMAG.  In case the
   L-flag is set to 0, the LMA will switch the downlink path immediately
   to the nMAG after the PBU has been processed.

   A-Flag: Indicates that the LMA must enter the Transient-A state



Liebsch, et al.          Expires August 15, 2009               [Page 23]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   before entering Active state when set to 1.  The LMA omits the
   Transient-A state during activation of a transient BCE state when set
   to 0.

   Lifetime: Lifetime of a Transient-L state in multiple of 100ms.  In
   case the L-Flag of the Transient Binding option is set to 1, the
   Lifetime field MUST be set to a non-zero value.












































Liebsch, et al.          Expires August 15, 2009               [Page 24]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


6.  IANA Considerations

   This specification adds a new Mobility Header option, the Transient
   Binding option.  The Transient Binding option is described in Section
   Section 5.1.  The Type value for this option needs to be assigned
   from the same numbering space as allocated for the other mobility
   options, as defined in [RFC3775].

   This specification also adds one status code value to the Proxy
   Binding Acknowledge message, the PBU_ACCEPTED_TB_IGNORED status code.
   The PBU_ACCEPTED_TB_IGNORED status code is described in section
   Section 4.7.  Its value must be assigned from the same number space
   used for the Mobile IPv6 Binding Acknowledgement status values, as
   defined in [RFC3775], and must be smaller 128.





































Liebsch, et al.          Expires August 15, 2009               [Page 25]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


7.  Security Considerations

   Signaling between MAGs and LMAs as well as information carried by PBU
   and PBA messages is protected and authenticated according to the
   mechanisms described in [RFC5213].

   In case MAGs or LMAs make use of a further protocol interface to an
   external component, such as for support of transient BCE control, the
   associated protocol must be protected and information must be
   authenticated.









































Liebsch, et al.          Expires August 15, 2009               [Page 26]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


8.  Protocol Configuration Variables

   LMA values:

   o  'ACTIVATIONDELAY' : This value is set by default to 2000 ms and
      can be administratively adjusted.













































Liebsch, et al.          Expires August 15, 2009               [Page 27]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


9.  Contributors

   Many thanks to Jun Awano, Suresh Krishnan, Long Le, Kent Leung,
   Basavaraj Patil and Rolf Sigle for contributing to this document.















































Liebsch, et al.          Expires August 15, 2009               [Page 28]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


10.  Acknowledgments

   The authors would like to thank Telemaco Melia, Vijay Devarapalli and
   Ryuji Wakikawa for their comments to improve this specification.















































Liebsch, et al.          Expires August 15, 2009               [Page 29]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


11.  References

11.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC3775]  Johnson, D., Perkins, C., and J. Arkko, "Mobility Support
              in IPv6", RFC 3775, June 2004.

   [RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,
              "Neighbor Discovery for IP version 6 (IPv6)", RFC 4861,
              September 2007.

   [RFC4862]  Thomson, S., Narten, T., and T. Jinmei, "IPv6 Stateless
              Address Autoconfiguration", RFC 4862, September 2007.

   [RFC5213]  Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K.,
              and B. Patil, "Proxy Mobile IPv6", RFC 5213, August 2008.

11.2.  Informative References

   [I-D.premec-netlmm-intertech-handover]
              Premec, D. and T. Savolainen, "Inter-technology handover
              in netlmm domain",
              draft-premec-netlmm-intertech-handover-00 (work in
              progress), April 2008.

   [I-D.sarikaya-netlmm-itho]
              Sarikaya, B. and F. Xia, "Proxy Mobile IPv6 Inter-
              Technology Handover Issue", draft-sarikaya-netlmm-itho-00
              (work in progress), June 2008.

   [RFC4831]  Kempf, J., "Goals for Network-Based Localized Mobility
              Management (NETLMM)", RFC 4831, April 2007.
















Liebsch, et al.          Expires August 15, 2009               [Page 30]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


Appendix A.  Example Use Cases for Transient BCE

A.1.  Use case for Single Radio Handover

   In some systems, PMIPv6 is supported for providing network based
   mobility between the Serving Gateway (i.e.  MAG) and the Packet Data
   Network Gateway (i.e.  LMA) and handover mechanisms are implemented
   in the access network to optimize handover for single radio mobile
   nodes.

   In such system, a well structured inter-MAG handover procedure has
   been developed and effectively used.  In order to switch the data
   tunnel path between the LMA and the pMAG in a systematic way that
   reduces packet loss and delay, this inter-MAG handover sets up the
   uplink data path from the mobile node through the nMAG and to the LMA
   first.  As soon as the uplink data path is setup, the mobile node is
   able to forward uplink data packets through the nMAG to the LMA.

   Since the downlink data path between the LMA and the nMAG is not
   setup at the same time of the uplink data path setup, the LMA must
   continue to forward downlink data packets to the pMAG.  Additionally,
   this system utilizes a layer 2 forwarding mechanism which enables the
   delivery of the downlink data packets to the mobile node location
   while being attached to the nMAG.

   In order for the LMA to be able to forward the mobile node uplink
   data packets to the Internet, the transient BCE mechanism is used at
   the nMAG to send a PBU with the Transient Option to allow the LMA to
   create a transient BCE for the mobile node with uplink forwarding
   capabilities while maintaining uplink and downlink forwarding
   capabilities for the pCoA that is hosted at the pMAG.

   During the lifetime of the transient BCE, the LMA continues to accept
   uplink traffic from both previous and new MAG while forwarding
   downlink traffic to the pMAG only.  While the MN is able to receive
   downlink traffic via the pMAG, the mechanism used in the pMAG's
   access network to forward downlink traffic to the current location of
   the mobile node in the nMAG's access network during an intra-
   technology handover is out of scope of this description.

   When the nMAG receives an indication that the inter-MAG handover
   process has completed, the nMAG sends another PBU without including a
   Transient Binding option to update the mobile node's transient BCE to
   a regular PMIPv6 BCE with bi-directional capabilities.  This
   mechanism is used by the LMA as an indication to switch the tunnel to
   point to the nMAG, which results in a smoother handover for the MN.

   An example of using a transient BCE for intra-technology handover is



Liebsch, et al.          Expires August 15, 2009               [Page 31]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   illustrated in Figure 6.  When the nMAG receives the indication that
   the MN is moving from the pMAG's access network to the nMAG's area,
   the nMAG sends a PBU on behalf of the MN to the MN's LMA.  In this
   PBU, the nMAG includes the MN-ID, the HNP, and the interface ID as
   per PMIPv6 base protocol [RFC5213].

   Furthermore, the nMAG indicates an intra-technology handover by means
   of the HI option and includes the Transient Binding option to
   indicate to the LMA that this registration should result in a
   transient BCE.  The nMAG sets the value of the transient BCE lifetime
   to a value that is dependent on the deployment and operator specific
   [D].

   After the nMAG receives an indication that the MN has completed the
   handover process and the data path is ready to move the tunnel
   completely from the pMAG to the nMAG, the nMAG SHOULD send a PBU to
   allow the LMA to activate the MN's transient BCE to a regular BCE and
   to switch the data path completely to be delivered through the new
   Proxy-CoA.  In this case, the nMAG sends a PBU with the MN-ID,
   Interface ID, HNP and at the same time indicates an intra-technology
   handover by means of the HI option.  In this PBU, the nMAG MUST NOT
   include the Transient Binding option, as shown in Figure 6 [E].

   In the event that the nMAG receives downlink traffic destined to the
   MN from the LMA after sending a PBU with Transient Binding option
   included, the nMAG MUST deliver the downlink traffic to the MN.  In
   this case, the nMAG SHOULD send a PBU to ensure that the transient
   BCE has been activated.























Liebsch, et al.          Expires August 15, 2009               [Page 32]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


          +-----+      +----+       +----+                    +-----+
          | MN  |      |pMAG|       |nMAG|                    | LMA |
          +-----+      +----+       +----+                    +-----+
             |            |            |  bi-directional         |
             |            |<<<<<<<<======================>>>>>>>>|<-->
             |            |            |                         |
             |            |            |                         |
       [Handoff Event]    |            |                         |
             |      [MN HO Event]      |                         |
             |            |     [HO Event Acquire]               |
             |            |            |                         |
      [LL Attach to       |            |                         |
           nMAG]          |            |-----PBU(transient)----->|
             |            |            |                        [D]
             |            |            |<-----PBA(transient)-----|
             |            |            |                         |
             |            |          bi-directional              |
             |            |<<<<<<<<======================>>>>>>>>|<-->
             |            |            |                         |
             |            |            |      uplink only        |
             |            |            |>>>>>>===========>>>>>>>>|-->
             |            |            |                         |
             |            |      [HO Complete]                   |
             |            |            |----------PBU----------->|
             |            |            |                        [E]
             |            |            |<---------PBA -----------|
             |            |`           |                         |
             |            |            |<<<<<<<<=========>>>>>>>>|<-->
             |            |            |                         |

     Figure 6: Transient BCE support for an intra-technology handover

A.2.  Use case for Dual Radio Handover

   During an inter-technology handover, the LMA shall on the one hand be
   able to accept uplink packets of the MN as soon as the MN has
   finalized address configuration at the new IF2 and may start using
   the new interface for data traffic, i.e. the PBU for the uplink shall
   be done before the radio setup procedure is finalized.  But, to allow
   the MN to keep sending its data traffic on IF1 during the handover,
   uplink packets with the previously existing binding on IF1 shall
   still be accepted by the LMA until the MN detaches from pMAG with IF1
   and the pMAG has deregistered the MN's attachment at the LMA by means
   of sending a PBU with lifetime 0.  This is of particular importance
   as sending the registration PBU from the nMAG is transparent to the
   mobile node, i.e. the MN does not know when the PBU has been sent.
   On the other hand, switching the downlink path from the pMAG to the
   nMAG shall be performed at the LMA only after completion of the IP



Liebsch, et al.          Expires August 15, 2009               [Page 33]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   configuration at the MN's IF2 and after a complete setup of the
   access link between the MN and the nMAG.  How long this takes depends
   on some interface specific settings on the MN as well as on the
   duration of the target system's radio layer protocols, which is
   transparent to the LMA but may be known to MAGs.

   Similar to the use case for single radio handover, a transient BCE
   can be utilized for MNs with dual radio capability.  Such MNs are
   still able to send and receive data on the previous interface during
   the new address configuration.  Forwarding between nMAG and pMAG is
   not required, but it has to be avoided that the LMA immediately
   starts forwarding downlink data packets to the nMAG.  This is enabled
   by a PBU which has the Transient Binding option included, so that it
   is not necessary that MN and LMA synchronize the point in time for
   switching interfaces and activating the BCE.

   When the handover is finalized, the nMAG sends a second PBU without
   including the Transient Binding option and the LMA activates the MN's
   BCE.  This PBU may overtake packets-on-the-fly from MN to LMA via
   pMAG (e.g. if the previous interface was of type GSM or UMTS with up
   to 150 milliseconds uplink delay).  The LMA has to drop all these
   packets from the pMAG due to the activation of the MN's BCE.  This
   can be avoided by entering another transient BCE state (Transient-A)
   during the activation phase and is characteristic for this use case.
   Entering the Transient-A state during activation is configured by the
   PBU from nMAG and terminated by the preconfigured lifetime
   ACTIVATIONDELAY.

   The use of a transient BCE for an inter-technology handover is
   exemplarily illustrated in Figure 7.  The MN attaches to the PMIPv6
   network with IF1 according to the procedure described in [RFC5213].
   The MN starts receiving data packets on IF1.  When the MN activates
   IF2 to prepare an inter-technology handover, the nMAG receives an
   attach indication and sends the PBU to the LMA to update the MN's
   point of attachment and to retrieve configuration information for the
   MN (e.g.  HNP).  The LMA is able to identify an inter-technology
   handover by means of processing the HI option coming along with the
   PBU sent by the nMAG.  As in this example the nMAG includes the
   Transient Binding option in the PBU to control the transient BCE at
   the LMA, the LMA updates the MN's BCE according to the transient BCE
   specification described in this document and marks the state of the
   BCE as 'transient' [F].

   As a result of the transient BCE, the LMA keeps using the previous
   forwarding information towards the pMAG binding as forwarding
   information until the transient BCE gets activated.  The LMA
   acknowledges the PBU by means of sending a PBA to the nMAG.  The nMAG
   has now relevant information available, such as the MN's HNP, to set



Liebsch, et al.          Expires August 15, 2009               [Page 34]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


   up a radio bearer and send a Router Advertisement to the MN.  While
   the MN's BCE at the LMA has transient characteristic, the LMA
   forwards uplink packets from the MN's pMAG as well as from its nMAG.
   The nMAG may recognize when the MN's IF2 is able to send and receive
   data packets and sends a new PBU to the LMA without including the
   Transient Binding option to activate the MN's transient BCE [G].  As
   a result of successful activation of the MN's transient BCE, downlink
   packets will be forwarded towards the MN's IF2 via the nMAG [H].


    +------+                 +----+      +----+                 +---+
    |  MN  |                 |pMAG|      |nMAG|                 |LMA|
    +------+                 +----+      +----+                 +---+
    IF2 IF1                    |           |                      |
     |   |                     |           |                      |
     |   |- - - - - - - - - Attach         |                      |
     |   |                     |---------------PBU--------------->|
     |   |                     |<--------------PBA----------------|
     |   |--------RtSol------->|           |                      |
     |   |<-------RtAdv--------|           |                      |
     |  Addr.                  |           |                      |
     |  Conf.                  |           |                      |
     |   |<------------------->|==================data============|<--->
     |   |                     |           |                      |
     |- - - - - - - - - - - - - - - - - Attach                    |
     |   |                     |           |----PBU(transient)--->|
     |   |                     |           |<---PBA(transient)---[F]
     |------RAT Configuration--------------|                      |
     |   |<--------------------|==================data============|<---
     |-------RtSol-(optional)------------->|                      |
     |<-----------RtAdv--------------------|                      |
   Addr. |                     |           |                      |
   Conf  |                     |           |                      |
     |------------NSol-------------------->|---------PBU-------->[G]
     |   |                     |           |<--------PBA----------|
     |<------------------------------------|========data=========[H]<-->
     |   |                     |           |                      |
     |   |                     |           |                      |
     |   |                     |           |                      |

          Figure 7: Late path switch with PMIPv6 transient BCEs.










Liebsch, et al.          Expires August 15, 2009               [Page 35]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


Appendix B.  Change Notes for version 1

   o  Moved description of use cases to Appendix

   o  Removed references to exemplary use cases in technical core part

   o  Moved section 'Impact on Binding Management' (now 4.2) after the
      General Approach section (4.1)

   o  Provide more details (originally in use cases sections) in General
      Approach section (4.1) to compensate the gap from shifting the use
      case section to the appendix

   o  More clarifying details in the LMA Forwarding diagram section (now
      4.3)

   o  Added section 4.8 about Protocol Stability/Reliability

   o  Added Acknowledgements section

   o  Small editorial improvements






























Liebsch, et al.          Expires August 15, 2009               [Page 36]

Internet-Draft   Transient Binding for Proxy Mobile IPv6   February 2009


Authors' Addresses

   Marco Liebsch
   NEC Laboratories Europe
   NEC Europe Ltd.
   Kurfuersten-Anlage 36
   69115 Heidelberg,
   Germany

   Phone: +49 6221 4342146
   Email: marco.liebsch@nw.neclab.eu


   Ahmad Muhanna
   Nortel Networks
   2221 Lakeside Blvd.
   Richardson, TX  75082,
   USA

   Phone: +1 (972) 685-1416
   Email: amuhanna@nortel.com


   Oliver Blume
   Alcatel-Lucent Deutschland AG
   Bell Labs
   Lorenzstr. 10
   70435 Stuttgart,
   Germany

   Phone: +49 711 821-47177
   Email: oliver.blume@alcatel-lucent.de



















Liebsch, et al.          Expires August 15, 2009               [Page 37]

